esp8266/Arduino/boards.txt
##############################################################
espresso_lite_v2.name=ESPresso Lite 2.0
espresso_lite_v2.build.board=ESP8266_ESPRESSO_LITE_V2
espresso_lite_v2.build.variant=espresso_lite_v2
espresso_lite_v2.upload.tool=esptool
espresso_lite_v2.upload.maximum_data_size=81920
espresso_lite_v2.upload.wait_for_upload_port=true
espresso_lite_v2.upload.erase_cmd=
espresso_lite_v2.serial.disableDTR=true
espresso_lite_v2.serial.disableRTS=true
espresso_lite_v2.build.mcu=esp8266
espresso_lite_v2.build.core=esp8266
espresso_lite_v2.build.spiffs_pagesize=256
espresso_lite_v2.build.debug_port=
espresso_lite_v2.build.debug_level=
espresso_lite_v2.menu.xtal.80=80 MHz
espresso_lite_v2.menu.xtal.80.build.f_cpu=80000000L
espresso_lite_v2.menu.xtal.160=160 MHz
espresso_lite_v2.menu.xtal.160.build.f_cpu=160000000L
espresso_lite_v2.menu.vt.flash=Flash
espresso_lite_v2.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espresso_lite_v2.menu.vt.heap=Heap
espresso_lite_v2.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espresso_lite_v2.menu.vt.iram=IRAM
espresso_lite_v2.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espresso_lite_v2.build.flash_mode=dio
espresso_lite_v2.build.flash_freq=40
espresso_lite_v2.menu.eesz.4M=4M (no SPIFFS)
espresso_lite_v2.menu.eesz.4M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M.build.flash_size_bytes=0x400000
espresso_lite_v2.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
espresso_lite_v2.menu.eesz.4M.build.spiffs_pagesize=256
espresso_lite_v2.menu.eesz.4M.upload.maximum_size=1044464
espresso_lite_v2.menu.eesz.4M.build.rfcal_addr=0x3FC000
espresso_lite_v2.menu.eesz.4M1M=4M (1M SPIFFS)
espresso_lite_v2.menu.eesz.4M1M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M1M.build.flash_size_bytes=0x400000
espresso_lite_v2.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espresso_lite_v2.menu.eesz.4M1M.build.spiffs_pagesize=256
espresso_lite_v2.menu.eesz.4M1M.upload.maximum_size=1044464
espresso_lite_v2.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
espresso_lite_v2.menu.eesz.4M2M=4M (2M SPIFFS)
espresso_lite_v2.menu.eesz.4M2M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M2M.build.flash_size_bytes=0x400000
espresso_lite_v2.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espresso_lite_v2.menu.eesz.4M2M.build.spiffs_pagesize=256
espresso_lite_v2.menu.eesz.4M2M.upload.maximum_size=1044464
espresso_lite_v2.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
espresso_lite_v2.menu.eesz.4M3M=4M (3M SPIFFS)
espresso_lite_v2.menu.eesz.4M3M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M3M.build.flash_size_bytes=0x400000
espresso_lite_v2.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
espresso_lite_v2.menu.eesz.4M3M.build.spiffs_pagesize=256
espresso_lite_v2.menu.eesz.4M3M.upload.maximum_size=1044464
espresso_lite_v2.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
espresso_lite_v2.menu.ResetMethod.ck=ck
espresso_lite_v2.menu.ResetMethod.ck.upload.resetmethod=ck
espresso_lite_v2.menu.ResetMethod.nodemcu=nodemcu
espresso_lite_v2.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
espresso_lite_v2.menu.ip.lm2=v2 Lower Memory
espresso_lite_v2.menu.ip.lm2.build.lwip_include=lwip2/include
espresso_lite_v2.menu.ip.lm2.build.lwip_lib=-llwip2
espresso_lite_v2.menu.ip.lm2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
espresso_lite_v2.menu.ip.hb2=v2 Higher Bandwidth
espresso_lite_v2.menu.ip.hb2.build.lwip_include=lwip2/include
espresso_lite_v2.menu.ip.hb2.build.lwip_lib=-llwip2_1460
espresso_lite_v2.menu.ip.hb2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
espresso_lite_v2.menu.ip.hb1=v1.4 Higher Bandwidth
espresso_lite_v2.menu.ip.hb1.build.lwip_lib=-llwip_gcc
espresso_lite_v2.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
espresso_lite_v2.menu.ip.src=v1.4 Compile from source
espresso_lite_v2.menu.ip.src.build.lwip_lib=-llwip_src
espresso_lite_v2.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
espresso_lite_v2.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espresso_lite_v2.menu.dbg.Disabled=Disabled
espresso_lite_v2.menu.dbg.Disabled.build.debug_port=
espresso_lite_v2.menu.dbg.Serial=Serial
espresso_lite_v2.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espresso_lite_v2.menu.dbg.Serial1=Serial1
espresso_lite_v2.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espresso_lite_v2.menu.lvl.None____=None
espresso_lite_v2.menu.lvl.None____.build.debug_level=
espresso_lite_v2.menu.lvl.SSL=SSL
espresso_lite_v2.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espresso_lite_v2.menu.lvl.TLS_MEM=TLS_MEM
espresso_lite_v2.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espresso_lite_v2.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espresso_lite_v2.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.lvl.HTTP_SERVER=HTTP_SERVER
espresso_lite_v2.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espresso_lite_v2.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espresso_lite_v2.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espresso_lite_v2.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.CORE=CORE
espresso_lite_v2.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espresso_lite_v2.menu.lvl.WIFI=WIFI
espresso_lite_v2.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espresso_lite_v2.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espresso_lite_v2.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espresso_lite_v2.menu.lvl.UPDATER=UPDATER
espresso_lite_v2.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espresso_lite_v2.menu.lvl.OTA=OTA
espresso_lite_v2.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espresso_lite_v2.menu.lvl.OOM=OOM
espresso_lite_v2.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espresso_lite_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espresso_lite_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espresso_lite_v2.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espresso_lite_v2.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espresso_lite_v2.menu.wipe.none=Only Sketch
espresso_lite_v2.menu.wipe.none.upload.erase_cmd=
espresso_lite_v2.menu.wipe.sdk=Sketch + WiFi Settings
espresso_lite_v2.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
espresso_lite_v2.menu.wipe.all=All Flash Contents
espresso_lite_v2.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
espresso_lite_v2.menu.baud.115200=115200
espresso_lite_v2.menu.baud.115200.upload.speed=115200
espresso_lite_v2.menu.baud.9600=9600
espresso_lite_v2.menu.baud.9600.upload.speed=9600
espresso_lite_v2.menu.baud.57600=57600
espresso_lite_v2.menu.baud.57600.upload.speed=57600
espresso_lite_v2.menu.baud.230400.linux=230400
espresso_lite_v2.menu.baud.230400.macosx=230400
espresso_lite_v2.menu.baud.230400.upload.speed=230400
espresso_lite_v2.menu.baud.256000.windows=256000
espresso_lite_v2.menu.baud.256000.upload.speed=256000
espresso_lite_v2.menu.baud.460800.linux=460800
espresso_lite_v2.menu.baud.460800.macosx=460800
espresso_lite_v2.menu.baud.460800.upload.speed=460800
espresso_lite_v2.menu.baud.512000.windows=512000
espresso_lite_v2.menu.baud.512000.upload.speed=512000
espresso_lite_v2.menu.baud.921600=921600
espresso_lite_v2.menu.baud.921600.upload.speed=921600

